In [129]:
import pandas as pd

In [130]:
rawdata = pd.read_excel(r"C:\Users\mdreh\Downloads\Rawdata.xlsx")

In [131]:
rawdata

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [132]:
rawdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [133]:
rawdata.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [134]:
rawdata.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [135]:
rawdata['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [136]:
# cleaning process

In [137]:
rawdata['Name'] = rawdata['Name'].str.replace(r'\W', '', regex = True)

In [138]:
rawdata['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [139]:
rawdata

    Name          Domain       Age   Location   Salary      Exp
0   Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy         Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3   Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam      Statistics     67-yr        NaN   30000-  5+ year
5    Kim             NLP      55yr      Delhi  6000^$0      10+

In [140]:
rawdata['Domain'] = rawdata['Domain'].str.replace(r'\W','',regex=True)
rawdata['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [141]:
rawdata['Age'] = rawdata['Age'].str.replace(r'\W','',regex=True)
rawdata['Location'] = rawdata['Location'].str.replace(r'\W','',regex=True)
rawdata['Salary'] = rawdata['Salary'].str.replace(r'\W','',regex=True)
rawdata['Exp'] = rawdata['Exp'].str.replace(r'\W','',regex=True)

In [142]:
rawdata

    Name       Domain      Age   Location Salary    Exp
0   Mike  Datascience  34years     Mumbai   5000      2
1  Teddy      Testing     45yr  Bangalore  10000      3
2   Umar  Dataanalyst      NaN        NaN  15000   4yrs
3   Jane    Analytics      NaN   Hyderbad  20000    NaN
4  Uttam   Statistics     67yr        NaN  30000  5year
5    Kim          NLP     55yr      Delhi  60000     10

In [143]:
rawdata['Age'] = rawdata['Age'].str.extract(r'(\d+)')

In [144]:
rawdata['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [145]:
rawdata['Exp'] = rawdata['Exp'].str.extract(r'(\d+)')

In [146]:
rawdata

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [147]:
Clean_data = rawdata.copy()

In [148]:
Clean_data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [149]:
import numpy as np

In [150]:
Clean_data['Age'] =  Clean_data['Age'].fillna(np.mean( pd.to_numeric(Clean_data['Age'])))

In [151]:
Clean_data['Age'].isnull().sum()

0

In [152]:
Clean_data['Exp'] = Clean_data['Exp'].fillna(np.mean(pd.to_numeric(Clean_data['Exp'])))

In [153]:
Clean_data['Location'].isnull().sum()

2

In [154]:
mode_loc = Clean_data['Location'].mode()[0]

In [155]:
Clean_data['Location'] = Clean_data['Location'].fillna(mode_loc)

In [156]:
Clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [157]:
Clean_data.isnull().sum()

Name        0
Domain      0
Age         0
Location    0
Salary      0
Exp         0
dtype: int64

In [158]:
Clean_data

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25  Bangalore  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  4.8
4  Uttam   Statistics     67  Bangalore  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [159]:
Clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      object
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [160]:
Clean_data['Name'] = Clean_data['Name'].astype('category')
Clean_data['Domain'] = Clean_data['Domain'].astype('category')
Clean_data['Location'] = Clean_data['Location'].astype('category')
Clean_data['Age'] = Clean_data['Age'].astype(int)
Clean_data['Exp'] = Clean_data['Exp'].astype(int)
Clean_data['Salary'] = Clean_data['Salary'].astype(int)

In [161]:
Clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int32
 3   Location  6 non-null      category
 4   Salary    6 non-null      int32
 5   Exp       6 non-null      int32
dtypes: category(3), int32(3)
memory usage: 866.0 bytes

In [163]:
Clean_data.to_csv('clean_data.csv')

In [178]:
x = Clean_data[['Name', 'Domain', 'Age', 'Location', 'Exp']] # independent variable

In [179]:
x

    Name       Domain  Age   Location  Exp
0   Mike  Datascience   34     Mumbai    2
1  Teddy      Testing   45  Bangalore    3
2   Umar  Dataanalyst   50  Bangalore    4
3   Jane    Analytics   50   Hyderbad    4
4  Uttam   Statistics   67  Bangalore    5
5    Kim          NLP   55      Delhi   10

In [180]:
y = Clean_data[['Salary']] # Dependent variable

In [181]:
y

   Salary
0    5000
1   10000
2   15000
3   20000
4   30000
5   60000

In [182]:
imputation = pd.get_dummies(Clean_data)

In [183]:
imputation

,Age,Salary,Exp,Name_Jane,Name_Kim,Name_Mike,Name_Teddy,Name_Umar,Name_Uttam,Domain_Analytics,Domain_Dataanalyst,Domain_Datascience,Domain_NLP,Domain_Statistics,Domain_Testing,Location_Bangalore,Location_Delhi,Location_Hyderbad,Location_Mumbai
0,34,5000,2,False,False,True,False,False,False,False,False,True,False,False,False,False,False,False,True
1,45,10000,3,False,False,False,True,False,False,False,False,False,False,False,True,True,False,False,False
2,50,15000,4,False,False,False,False,True,False,False,True,False,False,False,False,True,False,False,False
3,50,20000,4,True,False,False,False,False,False,True,False,False,False,False,False,False,False,True,False
4,67,30000,5,False,False,False,False,False,True,False,False,False,False,True,False,True,False,False,False
5,55,60000,10,False,True,False,False,False,False,False,False,False,True,False,False,False,True,False,False